<?php

namespace App\Services\Report;

class ClientReportService implements ReportServiceInterface
{
    //Отчеты по клиентам
    //Клиенты по индустрии или сегментам: Разделить клиентов по отраслям, размерам компаний или типам бизнеса.
    //Анализ по частоте покупок: Сколько раз клиенты взаимодействуют с бизнесом (повторные продажи).
    //Клиенты с высокой активностью: Топ-клиенты по количеству взаимодействий.
    //Новые клиенты: Количество новых клиентов за определенный период.
    //Отток клиентов: Определить, какие клиенты перестали быть активными.
}
